In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Date

In [2]:
date = pd.read_csv('C:\\Users\\bonin\\csv_files\\date.csv')

In [3]:
date.head()

    date_id  year  month  day  quarter
0  20181231  2018     12   31        4
1  20181231  2018     12   31        4
2  20181231  2018     12   31        4
3  20181231  2018     12   31        4
4  20181231  2018     12   31        4

In [4]:
date.isnull().sum()

date_id    0
year       0
month      0
day        0
quarter    0
dtype: int64

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186073 entries, 0 to 186072
Data columns (total 5 columns):
date_id    186073 non-null int64
year       186073 non-null int64
month      186073 non-null int64
day        186073 non-null int64
quarter    186073 non-null int64
dtypes: int64(5)
memory usage: 7.1 MB

In [6]:
date.describe()

,date_id,year,month,day,quarter
count,1.860730e+05,186073.000000,186073.000000,186073.000000,186073.000000
mean,2.018285e+07,2018.222348,6.144357,15.537074,2.409329
std,1.607876e+04,1.611626,3.119824,8.789169,1.050138
min,2.016010e+07,2016.000000,1.000000,1.000000,1.000000
25%,2.017052e+07,2017.000000,4.000000,8.000000,2.000000
50%,2.018083e+07,2018.000000,6.000000,15.000000,2.000000
75%,2.019101e+07,2019.000000,9.000000,23.000000,3.000000
max,2.021082e+07,2021.000000,12.000000,31.000000,4.000000

In [7]:
date.drop_duplicates(subset="date_id",inplace=True)

In [8]:
date.shape

(375, 5)

In [9]:
date.head()

      date_id  year  month  day  quarter
0    20181231  2018     12   31        4
178  20190107  2019      1    7        1
303  20190114  2019      1   14        1
781  20190204  2019      2    4        1
898  20190211  2019      2   11        1

In [10]:
date.to_csv('C://Users//bonin/csv_files//date_cleaned.csv',index = False)

# Tournament

In [11]:
tournament = pd.read_csv('C://Users//bonin/csv_files//tournament.csv')

In [175]:
tournament.head()

,tourney_id,tourney_date,tourney_name,surface,draw_size,tourney_level,tourney_spectators,tourney_revenue
0,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69
1,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69
2,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69
3,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69
4,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69

In [176]:
tournament.drop_duplicates(subset ="tourney_id", inplace = True)

In [177]:
tournament.shape

(4853, 8)

In [178]:
tournament.head()

,tourney_id,tourney_date,tourney_name,surface,draw_size,tourney_level,tourney_spectators,tourney_revenue
0,2019-M020,20181231,Brisbane,Hard,32,A,3928,742618.69
96,2019-0451,20181231,Doha,Hard,32,A,2923,550943.19
139,2019-0891,20181231,Pune,Hard,32,A,4062,1005592.39
178,2019-0301,20190107,Auckland,Hard,32,A,2784,489426.09
217,2019-M001,20190107,Sydney,Hard,32,A,3258,567644.24

In [179]:
tournament.isnull().sum()

tourney_id             0
tourney_date           0
tourney_name           0
surface               62
draw_size              0
tourney_level          0
tourney_spectators     0
tourney_revenue        0
dtype: int64

In [180]:
tournament['surface'].value_counts()

Hard      2558
Clay      2042
Grass      103
Carpet      88
Name: surface, dtype: int64

In [181]:
tournament['surface'].fillna(limit = 34,value='Hard', inplace=True)

In [182]:
tournament['surface'].fillna(value='Clay', inplace=True)

In [183]:
tournament.isnull().sum()

tourney_id            0
tourney_date          0
tourney_name          0
surface               0
draw_size             0
tourney_level         0
tourney_spectators    0
tourney_revenue       0
dtype: int64

In [184]:
tournament.describe()

       tourney_date    draw_size  tourney_spectators  tourney_revenue
count  4.853000e+03  4853.000000         4853.000000     4.853000e+03
mean   2.018035e+07    29.052545         2915.778900     5.821028e+05
std    1.534445e+04    16.567840         1800.475159     3.788686e+05
min    2.016010e+07     2.000000           91.000000     1.786574e+04
25%    2.017021e+07    32.000000         2311.000000     4.316581e+05
50%    2.018042e+07    32.000000         3063.000000     5.943168e+05
75%    2.019072e+07    32.000000         3628.000000     7.354139e+05
max    2.021082e+07   128.000000        18086.000000     5.002794e+06

In [185]:
tournament.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4853 entries, 0 to 186018
Data columns (total 8 columns):
tourney_id            4853 non-null object
tourney_date          4853 non-null int64
tourney_name          4853 non-null object
surface               4853 non-null object
draw_size             4853 non-null int64
tourney_level         4853 non-null object
tourney_spectators    4853 non-null int64
tourney_revenue       4853 non-null float64
dtypes: float64(1), int64(3), object(4)
memory usage: 341.2+ KB

In [186]:
tournament.to_csv('C://Users//bonin/csv_files//tournament_cleaned.csv',index = False)

# Geography

In [187]:
geography = pd.read_csv("C://Users//bonin//csv_files//geography.csv",header=None)

In [188]:
geography.columns = ["country_ioc","country","continent","language"]

In [189]:
geography.head()

  country_ioc    country continent  language
0         JPN      Japan      Asia  Japanese
1         RUS     Russia    Europe     Yakut
2         FRA     France    Europe   Occitan
3         AUS  Australia   Oceania   English
4         CAN     Canada   America    Mohawk

In [190]:
geography.shape

(117, 4)

In [191]:
geography.duplicated(subset="country_ioc").sum()

0

In [192]:
geography.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117 entries, 0 to 116
Data columns (total 4 columns):
country_ioc    117 non-null object
country        117 non-null object
continent      117 non-null object
language       117 non-null object
dtypes: object(4)
memory usage: 3.8+ KB

In [193]:
geography[geography.language == "Unknown"]

   country_ioc                   country continent language
6          GBR             Great Britain    Europe  Unknown
8          USA  United States of America   America  Unknown
27         NZL                New Zeland   Oceania  Unknown
34         URU                    Urugay   America  Unknown
87         MKD           North Macedonia    Europe  Unknown
97         REU                   Reunion    Africa  Unknown
98         UNK                    Kosovo    Europe  Unknown

In [194]:
geography.loc[6,"language"] = "English"
geography.loc[8,"language"] = "English"
geography.loc[27,"language"] = "English"
geography.loc[34,"language"] = "Spanish"
geography.loc[87,"language"] = "Macedonian"
geography.loc[97,"language"] = "French"
geography.loc[98,"language"] = "Albanian"

In [195]:
geography[geography.language == " "]

    country_ioc           country continent language
33          MDA           Moldova    Europe
37          CYP            Cyprus    Europe
51          BAR          Barbados   America
78          PNG  Papua New Guinea   Oceania
81          GRN           Grenada    Europe
82          BAH           Bahamas   America
83          CUB              Cuba   America
90          BDI           Burundi    Africa
91          MRI         Mauritius    Africa
93          SAM             Samoa   Oceania
96          NAM           Namibia    Africa
100         HAI             Haiti   America
108         GUM              Guam   Oceania
109         GAB             Gabon    Africa
111         GUD        Guadeloupe   America
113         CMR          Cameroon    Africa
115         MAD        Madagascar    Africa
116         AND           Andorra    Europe

In [196]:
geography.language.replace(" ",np.nan,inplace=True)

In [197]:
geography[geography.language == " "]

Empty DataFrame
Columns: [country_ioc, country, continent, language]
Index: []

In [198]:
geography.isnull().sum()

country_ioc     0
country         0
continent       0
language       18
dtype: int64

In [199]:
geography.language.value_counts()

Spanish             18
English              8
Arabic               6
French               3
Serbian (Latin)      3
                    ..
Polish               1
Kyrgyz               1
Frisian              1
Italian              1
Tajik (Cyrillic)     1
Name: language, Length: 62, dtype: int64

In [200]:
geography.language.fillna("Spanish",inplace=True)

In [201]:
geography.isnull().sum()

country_ioc    0
country        0
continent      0
language       0
dtype: int64

In [202]:
geography.to_csv('C://Users//bonin//csv_files//geography_cleaned.csv',index = False)

# Match

In [203]:
match = pd.read_csv("C://Users//bonin//csv_files//match.csv")

In [204]:
match.head()

,tourney_id,match_id,winner_id,loser_id,score,best_of,round,minutes,w_ace,w_df,...,l_1stIn,l_1stWon,l_2ndWon,l_SvGms,l_bpSaved,l_bpFaced,winner_rank,winner_rank_points,loser_rank,loser_rank_points
0,2019-M020,2019-M020300,105453,106421,6-4 3-6 6-2,3,F,124.0,3.0,3.0,...,54.0,34.0,20.0,14.0,10.0,15.0,9.0,3590.0,16.0,1977.0
1,2019-M020,2019-M020299,106421,104542,7-6(6) 6-2,3,SF,82.0,10.0,1.0,...,52.0,36.0,7.0,10.0,10.0,13.0,16.0,1977.0,239.0,200.0
2,2019-M020,2019-M020298,105453,104871,6-2 6-2,3,SF,66.0,2.0,2.0,...,27.0,15.0,6.0,8.0,1.0,5.0,9.0,3590.0,40.0,1050.0
3,2019-M020,2019-M020297,104542,200282,6-4 7-6(2),3,QF,106.0,12.0,2.0,...,60.0,38.0,9.0,11.0,4.0,6.0,239.0,200.0,31.0,1298.0
4,2019-M020,2019-M020296,106421,105683,6-7(2) 6-3 6-4,3,QF,129.0,12.0,3.0,...,56.0,46.0,19.0,15.0,2.0,4.0,16.0,1977.0,18.0,1855.0

In [205]:
match.drop_duplicates(subset="match_id",inplace=True)

In [206]:
match.shape

(158393, 30)

In [207]:
match.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158393 entries, 0 to 186048
Data columns (total 30 columns):
tourney_id            158393 non-null object
match_id              158393 non-null object
winner_id             158393 non-null int64
loser_id              158393 non-null int64
score                 158247 non-null object
best_of               158393 non-null int64
round                 158393 non-null object
minutes               72967 non-null float64
w_ace                 73620 non-null float64
w_df                  73620 non-null float64
w_svpt                73620 non-null float64
w_1stIn               73620 non-null float64
w_1stWon              73620 non-null float64
w_2ndWon              73620 non-null float64
w_SvGms               73623 non-null float64
w_bpSaved             73620 non-null float64
w_bpFaced             73620 non-null float64
l_ace                 73620 non-null float64
l_df                  73620 non-null float64
l_svpt                73620 non-null float64
l_1stIn               73620 non-null float64
l_1stWon              73620 non-null float64
l_2ndWon              73620 non-null float64
l_SvGms               73623 non-null float64
l_bpSaved             73620 non-null float64
l_bpFaced             73620 non-null float64
winner_rank           146291 non-null float64
winner_rank_points    146275 non-null float64
loser_rank            133375 non-null float64
loser_rank_points     133359 non-null float64
dtypes: float64(23), int64(3), object(4)
memory usage: 37.5+ MB

In [208]:
match.isnull().sum()

tourney_id                0
match_id                  0
winner_id                 0
loser_id                  0
score                   146
best_of                   0
round                     0
minutes               85426
w_ace                 84773
w_df                  84773
w_svpt                84773
w_1stIn               84773
w_1stWon              84773
w_2ndWon              84773
w_SvGms               84770
w_bpSaved             84773
w_bpFaced             84773
l_ace                 84773
l_df                  84773
l_svpt                84773
l_1stIn               84773
l_1stWon              84773
l_2ndWon              84773
l_SvGms               84770
l_bpSaved             84773
l_bpFaced             84773
winner_rank           12102
winner_rank_points    12118
loser_rank            25018
loser_rank_points     25034
dtype: int64

In [209]:
# drop all columns that has >50% missing values

In [210]:
match = match[["tourney_id","match_id","winner_id","loser_id","score","best_of","round","winner_rank","winner_rank_points","loser_rank","loser_rank_points"]]

In [211]:
match.isnull().sum()

tourney_id                0
match_id                  0
winner_id                 0
loser_id                  0
score                   146
best_of                   0
round                     0
winner_rank           12102
winner_rank_points    12118
loser_rank            25018
loser_rank_points     25034
dtype: int64

In [212]:
match.dropna(subset=["score"],inplace=True)

In [213]:
match.winner_rank.fillna(match.winner_rank.median(),inplace=True)
match.winner_rank_points.fillna(match.winner_rank_points.median(),inplace=True)
match.loser_rank.fillna(match.loser_rank.median(),inplace=True)
match.loser_rank_points.fillna(match.loser_rank_points.median(),inplace=True)

In [214]:
match.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158247 entries, 0 to 186048
Data columns (total 11 columns):
tourney_id            158247 non-null object
match_id              158247 non-null object
winner_id             158247 non-null int64
loser_id              158247 non-null int64
score                 158247 non-null object
best_of               158247 non-null int64
round                 158247 non-null object
winner_rank           158247 non-null float64
winner_rank_points    158247 non-null float64
loser_rank            158247 non-null float64
loser_rank_points     158247 non-null float64
dtypes: float64(4), int64(3), object(4)
memory usage: 14.5+ MB

In [215]:
match.winner_rank = match.winner_rank.astype("int64")

In [216]:
match.winner_rank_points = match.winner_rank_points.astype("int64")

In [217]:
match.loser_rank = match.loser_rank.astype("int64")

In [218]:
match.loser_rank_points = match.loser_rank_points.astype("int64")

In [219]:
x = set(player.id_player)
y = set(match.winner_id)
z = set(match.loser_id)
fine = y.union(z)
tmp = set()

for i in fine:
    if i not in x:
        tmp.add(i)

In [220]:
match = match[~match['winner_id'].isin(tmp)]
match = match[~match['loser_id'].isin(tmp)]

In [221]:
match.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 158207 entries, 0 to 186048
Data columns (total 11 columns):
tourney_id            158207 non-null object
match_id              158207 non-null object
winner_id             158207 non-null int64
loser_id              158207 non-null int64
score                 158207 non-null object
best_of               158207 non-null int64
round                 158207 non-null object
winner_rank           158207 non-null int64
winner_rank_points    158207 non-null int64
loser_rank            158207 non-null int64
loser_rank_points     158207 non-null int64
dtypes: int64(7), object(4)
memory usage: 14.5+ MB

In [222]:
match.isnull().sum()

tourney_id            0
match_id              0
winner_id             0
loser_id              0
score                 0
best_of               0
round                 0
winner_rank           0
winner_rank_points    0
loser_rank            0
loser_rank_points     0
dtype: int64

In [223]:
match.to_csv('C://Users//bonin//csv_files//match_cleaned.csv',index = False)

# Player

In [224]:
player=pd.read_csv("C://Users//bonin//csv_files//player.csv",header=None)

In [225]:
player.columns = ["id_player","name","sex","country","ht","hand","birth_year"]

In [226]:
player.head()

   id_player                name   sex country     ht hand  birth_year
0     105453       Kei Nishikori     M     JPN  178.0    R        1989
1     106421     Daniil Medvedev     M     RUS  198.0    R        1995
2     104542  Jo-Wilfried Tsonga  Null     FRA  188.0    R        1985
3     104871       Jeremy Chardy     M     FRA  188.0    R        1986
4     200282      Alex De Minaur     M     AUS  183.0    R        1999

In [227]:
player.shape

(10104, 7)

In [228]:
player.isnull().sum()

id_player     0
name          0
sex           0
country       0
ht            0
hand          0
birth_year    0
dtype: int64

In [229]:
player.drop_duplicates(subset="id_player",inplace=True)

In [230]:
player.shape

(10055, 7)

In [231]:
player.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10055 entries, 0 to 10103
Data columns (total 7 columns):
id_player     10055 non-null int64
name          10055 non-null object
sex           10055 non-null object
country       10055 non-null object
ht            10055 non-null object
hand          10055 non-null object
birth_year    10055 non-null int64
dtypes: int64(2), object(5)
memory usage: 628.4+ KB

In [232]:
player.loc[2,"sex"] = "M"
player.loc[27,"sex"] = "M"
player.loc[62,"sex"] = "M"
player.loc[63,"sex"] = "M"
player.loc[102,"sex"] = "M"
player.loc[160,"sex"] = "M"
player.loc[189,"sex"] = "M"
player.loc[200,"sex"] = "M"
player.loc[201,"sex"] = "M"
player.loc[208,"sex"] = "M"
player.loc[244,"sex"] = "M"
player.loc[337,"sex"] = "M"
player.loc[344,"sex"] = "M"
player.loc[526,"sex"] = "M"
player.loc[550,"sex"] = "M"
player.loc[558,"sex"] = "M"
player.loc[791,"sex"] = "M"
player.loc[827,"sex"] = "M"
player.loc[838,"sex"] = "M"
player.loc[839,"sex"] = "M"
player.loc[854,"sex"] = "M"
player.loc[873,"sex"] = "M"
player.loc[897,"sex"] = "M"
player.loc[1034,"sex"] = "M"
player.loc[1036,"sex"] = "M"
player.loc[1899,"sex"] = "F"
player.loc[3184,"sex"] = "F"
player.loc[4502,"sex"] = "M"
player.loc[4589,"sex"] = "M"
player.loc[4699,"sex"] = "M"
player.loc[5610,"sex"] = "M"
player.loc[5928,"sex"] = "M"
player.loc[6365,"sex"] = "M"
player.loc[6375,"sex"] = "M"

In [233]:
player[player.ht=="Null"]              # REMOVE 9565 missing valules su 10055

       id_player                name sex country    ht hand  birth_year
6         106034   Yasutaka Uchiyama   M     JPN  Null    R        1992
8         106121         Taro Daniel   M     JPN  Null    R        1993
16        106423  Thanasi Kokkinakis   M     AUS  Null    R        1996
17        106109           Alex Bolt   M     AUS  Null    L        1992
28        215018      Destanee Aiava   F     AUS  Null    R        2000
...          ...                 ...  ..     ...   ...  ...         ...
10099     203535        Sultan Gonen   F     TUR  Null    R        1996
10100     223075    Madeleine Jessup   F     USA  Null    U           0
10101     223216          Katie Codd   F     USA  Null    U           0
10102     223217           Amy Huang   F     USA  Null    U           0
10103     223451     Chloe Henderson   F     USA  Null    U           0

[9516 rows x 7 columns]

In [234]:
player[player.hand=="U"]        # REMOVE 6299 missing values su 10055

       id_player                   name sex country    ht hand  birth_year
40        214040       Kimberly Birrell   F     AUS  Null    U        1998
66        134329            Blake Ellis   M     AUS  Null    U        2000
84        211941              Zoe Hives   F     AUS  Null    U        1998
119       122570  Mubarak Shannan Zayid   M     QAT  Null    U        1995
130       106325        Jabor Al Mutawa   M     QAT  Null    U        1996
...          ...                    ...  ..     ...   ...  ...         ...
10098     225861        Viktoria Veleva   F     BUL  Null    U           0
10100     223075       Madeleine Jessup   F     USA  Null    U           0
10101     223216             Katie Codd   F     USA  Null    U           0
10102     223217              Amy Huang   F     USA  Null    U           0
10103     223451        Chloe Henderson   F     USA  Null    U           0

[6265 rows x 7 columns]

In [235]:
player.loc[player.birth_year==0,"birth_year"] = player["birth_year"].median()

In [236]:
player.drop(columns= ["hand","ht"],inplace=True)

In [237]:
co = set()
for i in geography.country_ioc:
    co.add(i)

In [238]:
for i,j in enumerate(player.country):
    if j not in co:
        player.loc[i,"country"] = "Null"

In [239]:
player['country'] = player['country'].apply(lambda x: 'Null' if x not in co else x)

In [240]:
player[player.country == "Null"]

       id_player                     name  sex country  birth_year
119     122570.0    Mubarak Shannan Zayid    M    Null      1995.0
130     106325.0          Jabor Al Mutawa    M    Null      1996.0
138     110476.0       Mousa Shanan Zayed    M    Null      1994.0
1600    206431.0  Andressa Cristina Souza    F    Null      1998.0
1601    220265.0         Soizette Simmons    F    Null      1989.0
...          ...                      ...  ...     ...         ...
9971    223104.0            Alise Vindiga    F    Null      1997.0
10006   223434.0            Jhilik Chakma    F    Null      1997.0
10048   223027.0      Maria Jose Da Costa    F    Null      1997.0
10097   223315.0         Dilara Sultanova    F    Null      1997.0
6761         NaN                      NaN  NaN    Null         NaN

[203 rows x 5 columns]

In [241]:
len(player[player.country == "Null"])

203

In [242]:
b = "USA"
player.loc[player.country == "Null","country"] = b

In [243]:
player.dropna(inplace=True)

In [244]:
player.isnull().sum()

id_player     0
name          0
sex           0
country       0
birth_year    0
dtype: int64

In [245]:
player.id_player = player.id_player.astype("int64")
player.birth_year = player.birth_year.astype("int64")

In [246]:
player.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10055 entries, 0 to 10103
Data columns (total 5 columns):
id_player     10055 non-null int64
name          10055 non-null object
sex           10055 non-null object
country       10055 non-null object
birth_year    10055 non-null int64
dtypes: int64(2), object(3)
memory usage: 471.3+ KB

In [247]:
player

       id_player                name sex country  birth_year
0         105453       Kei Nishikori   M     JPN        1989
1         106421     Daniil Medvedev   M     RUS        1995
2         104542  Jo-Wilfried Tsonga   M     FRA        1985
3         104871       Jeremy Chardy   M     FRA        1986
4         200282      Alex De Minaur   M     AUS        1999
...          ...                 ...  ..     ...         ...
10099     203535        Sultan Gonen   F     TUR        1996
10100     223075    Madeleine Jessup   F     USA        1997
10101     223216          Katie Codd   F     USA        1997
10102     223217           Amy Huang   F     USA        1997
10103     223451     Chloe Henderson   F     USA        1997

[10055 rows x 5 columns]

In [248]:
player.to_csv('C://Users//bonin//csv_files//player_cleaned.csv',index = False)